// 标准士兵 cigarman

inherit FIGHTER;

#include <ansi.h>
#include "killer.h"
void check_fight(object me,object ob);

string *colors = ({""HIY"", ""HIG"", ""RED"", ""MAG"", ""YEL"", ""HIC"", ""HIW"", ""HIR"",""HIB"", ""CYN"",""WHT"",""HIM"",""BLU""});

string *nick_first=({

        "春雨", "夏雨", "秋雨", "冬雨", "春兰", "夏荷", "秋菊", "冬梅",
        "玉泉", "羽泉", "风泉", "虎泉", "怒涛", "江河", "漩流", "清水",
        "巨",   "大",   "小",   "怪",   "阖",   "阔",   "宾",   "叠",
        "青锋", "双锋", "锐气", "必胜", "吴钩", "桃花", "无敌", "双手", 
        "吉祥", "天女", "花纹", "暗光", "松纹", "蟠钢", "龟文", "盘古",
        "缦理", "流水", "芙蓉", "深渊", "高山", "大川", "流波", "冰释",
        "鱼鳞", "兽皮", "开山", "倒海", "复体", "锯齿", "沧海", "天门", 
        "地门", "雁翎", "飞燕", "燕尾", "慑魂", "夺魂", "弦月", "连衡", 
        "鬼号", "厉鬼", "鬼头", "鬼王", "牛头", "拘魂", "魂魄", "寒光", 
        "阴蛇", "照海", "地狱", "龙头", "猛虎", "曙光", "泼水", "暗光",
        "晦光", "明光", "天光", "神光", "鬼气", "仙品", "天水", "地水",
        "天锋", "地锋", "天雨", "神雨", "鬼雨", "地雨", "仙雨", "魔雨",
        "神水", "仙水", "魔水", "毒蛇", "五步", "竹叶", "柳叶", "天竹",
        "地竹", "神竹", "魔竹", "伤痕", "飞武", "猛虎", "猛狮", "啸天",
        "幻风", "望月", "明月", "赶月", "弯月", "豹枭", "虎枭", "狮枭",
        "野狼", "狂狼", "狂龙", "神狼", "神狮", "神虎", "神豹", "神鹰",
        "天羽", "地羽", "泪痕", "浪云", "乌发", "蝉鬓", "云髻", "雾鬟",
        "娥眉", "青黛", "明眸", "流盼", "朱唇", "皓齿", "玉指", "素臂",
        "晓翠", "春江", "夜月", "啼莺", "慈云", "浮云", "青云", "朝云",
        "夜云", "飞云", "卷云", "白云", "蓝云", "紫云", "红云", "赤云",
        "鸿门", "蛟龙", "雷霆", "狮吼", "卧虎", "青羊", "老君", "斗母",
        "贺兰", "日月", "玉门", "阡陌", "纵横", "承天", "延永", "玉皇",
        "松柏", "须弥", "秀骨", "清相", "洛神", "璎络", "圣母", "文昌",
        "武圣", "南天", "北天", "西天", "东天", "飞雪", "飘雪", "落雪",
        "白雪", "梦雪", "雪花", "烟雨", "霞蔚", "赤霞", "潇湘", "瀚海",
        "牡丹", "百合", "白荷", "龙菊", "幽兰", "翡翠", "寒梅", "青竹",
        "相思", "云竹", "海棠", "芍药", "杜鹃", "玫瑰", "月季", "四季",
        "芙蓉", "蔷薇", "苍岩", "天师", "洗心", "常青", "翻天", "降魔",
        "風鈴", "風信", "紫陽", "丹陽", "紫薇", "木樨", "富貴", "太陽",
        "火鶴", "青鶴", "白鶴", "紫鶴", "白薇", "蓝薇", "青薇", "火薇",
        "冰薇", "青陽", "白陽", "火陽", "冰陽", "天秤", "巨蟹", "金牛",
        "扣骨", "渡心", "含翠", "蝙蝠", "月形", "黑云", "铁鲨", "撼山",
        "断玉", "摘星", "探星", "飞星", "黑魅", "绿影", "玉魔", "银铃",
        "金铃", "千仞", "晶电", "千芒", "阴霾", "魔袱", "戈壁", "江南",
        "蚁峻", "矗页", "睚眦", "螭吻", "蒲牢", "饕餮", "蜍夏", "椒图",
        "血斩", "天威", "旋风", "紫芒", "削岩", "万丈", "星龙", "月龙",
        "巨威", "影残", "璨星", "裂心", "双星", "望霞", "翠屏", "朝云",
        "松峦", "集仙", "聚鹤", "净坛", "上升", "起云", "飞凤", "登龙",
        "聚泉", "南海", "平原", "辽东", "川西", "平阳", "天外", "独孤",
        "飘雪", "求败", "无心", "红粉", "夕阳", 
});

string *nick_second=({
        "帝王", "王者", "天后", "霸王", "天圣", "神王", "妖后", "公侯", 
        "魔王", "七星", "恶鬼", "玉龙", "玉凤", "松鹤", "天龙", "地龙",
        "天凤", "地凤", "龙翔", "凤舞", "无影", "破甲", "飞龙", "武翼",
        "鸟翔", "婉盘", "青萍", "黄龙", "云梯", "太渊", "太风", "虚灵",
        "霹雳", "雷电", "风雷", "震电", "白玉", "青玉", "紫玉", "蓝玉",
        "绿玉", "黄玉", "赤玉", "红玉", "青虹", "白虹", "紫虹", "蓝虹",
        "绿虹", "赤虹", "幻影", "凝霜", "青索", "天龙", "紫电", "凤凰",
        "天枢", "天璇", "天玑", "天权", "玉衡", "开阳", "摇光", "北斗",
        "天火", "麒麟", "辟邪", "鸿钧", "广成", "金光", "修罗", "夜叉",
        "瑶池", "泪痕", "火龙", "冰龙", "黑龙", "炎龙", "青龙", "朱雀",
        "白虎", "玄武", "玄机", "九天", "九幽", "九龙", "五龙", "三龙",
        "生死", "老人",
        "霸",   "刀",   "剑",   "枪",   "鞭",   "索",   "红",   "娇", 
        "虎",   "豹",   "客",   "侠",   "龙",
});

string create_nick()
{
        string nick1,nick2;
        nick1=nick_first[random(sizeof(nick_first))];
        nick2=nick_second[random(sizeof(nick_second))];
        return colors[random(13)]+nick1+colors[random(13)]+nick2;
}

void create()
{
        mapping name;
        int i = random(4);
        string nickname = create_nick();
        name = RNAME_D->get_random_name(i);
        set_name(name["name"], name["id"]);
        set("nickname",nickname+NOR);
        set("meitude", "peaceful");
        set("age", random(20)+25);
        set("str", 20);
        set("int", 20);
        set("con", 20);     
        set("dex", 20);
        set("combat_exp", 5000000);    
        set("max_qi", 20000);
        set("max_jing", 2000);
        set("max_jingli", 2000);
        set("max_neili", 5000);
        set("neili", 5000);
        set("chat_chance", 20);
        set("chat_msg", ({                                                                                                                      
                (: random_move :),           
        }));
        set("max_cure",5);    
        setup();
        carry_object(ARMOR_D("cloth"))->wear();
         add_money("silver",30+random(30));
        if (clonep())
        {
          this_object()->setparty(1,500,this_object()->query("combat_exp"));
          "/cmds/skill/skills"->main(this_object());
           call_out("dest", 300);
        }
}

void dest()
{       command("say 本想于你生死一战，怎奈我有要事在身，就此别过！！！");
        say(name()+"几个起落上了屋顶，急驰而去。\n");
        destruct(this_object());
}

