// shiwu.c 大石屋
inherit ROOM;
#include <ansi.h>
void create()
{
            set("short", HIW"大石屋"NOR);
            set("long",@LONG
一座极大的石屋出现在眼前，只见两名绿衫僮儿手执拂尘，站在石屋门前。
石屋二边是绝壁峭崖，几株长在绝壁上松树长得很茂盛，把石屋遮得严严实实
的，远远看来，几乎看不出在这深谷中还有座石屋。
LONG
       );
            set("exits",([
              "south": __DIR__"qsroad",
              "enter": __DIR__"dating",
            ]));

            set("outdoor","绝情谷");
            set("objects",([
               __DIR__"npc/fan": 1,
               __DIR__"npc/tonger2": 2,
            ]));
	    setup();
}

int valid_leave(object ob, string dir)
{
	        if ( ob->query_temp("quest/jindaoheijian/waityd"))
             return notify_fail("你还是先安心解谜吧！！\n");
        if ( present("fan yiweng", environment(ob)) 
           && dir =="enter")
         return notify_fail("樊一翁拦住你的去路，抱拳道：绝情谷中禁止外派弟子进入。\n");
         return ::valid_leave(ob, dir);
}

void init()
{
	object me;
  me = this_player();
  if (this_player()->query_temp("quest/jindaoheijian/waityd"))
    {
     message_vision(HIM"樊一翁将黄蓉、一灯、郭芙等挡在大厅之外，杨过和小龙女正在花前并肩共语。不久程英和陆\n"+
                       "无双到来。小龙女见程英温雅腼腆，甚是投缘，拉住她的手说话。陆无双向杨过述说适才跟郭\n"+
                       "芙比武之事，怎样讥刺得她哭笑不得，程英又怎样制得她失剑输阵。杨过这番再和程、陆二女\n"+
                       "相会，想到她二人对己情意深重，而自己无以还报，心中不免歉疚，眼见陆无双明知自己己娶\n"+
                       "小龙女为妻，却无怨怼之状，口口声声的说惩戒郭芙为自己出气，而程英对小龙女也是神情亲\n"+
                       "切，自是大为欣慰。\n"NOR,me);
     remove_call_out("action1");
     call_out("action1", 1, me);  
    }      
}     

void action1(object me)
{
  if(!me) return;
     message_vision(HIW"四人坐在石上，小龙女和程英说话，杨过和陆无双说话。但龙、程二人性子沉静，均是不擅言\n"+
                       "辞，只说得几句便住了口。杨过和陆无双却你一句“傻蛋”、我一句“媳妇儿”的有说有笑。\n"+
                       "程英突然插口笑道：“杨大哥，你现下有了杨大嫂，叫我表妹可得改改口了。”\n"NOR,me);

   remove_call_out("action2");
   call_out("action2", 1, me);  
}

void action2(object me)
{
  if(!me) return;
     message_vision(HIC"程英和陆无双一齐失惊，问道：“怎么？杨大嫂也受了伤吗？我们竟一点没瞧出来。”小龙女\n"+
                       "微笑道：“也没怎样。我运内力裹住毒质，不让它发作，几天之中，谅无大碍。”陆无双道：\n"+
                       "“是甚么毒？也是情花之毒么？”小龙女道：“不是，是我师姊的冰魄银针。”陆无双道：“\n"+
                       "原来又是李莫愁这魔头。傻……杨大哥，你不是瞧过她那本《五毒秘传》么？冰魄银针之毒虽\n"+
                       "厉害，却也并不难解。”\n"NOR,me);
  	remove_call_out("action3");
    call_out("action3", 1, me);  
}

void action3(object me)
{
  if(!me) return;
     message_vision(HIW"杨过叹了口气，说道：“毒质侵入了脏腑，非寻常解药可治。”于是将小龙女如何逆经脉疗伤\n"+
                       "、郭芙如何误发毒针之事说了。陆无双伸手在石上重重一拍，恨恨的道：“郭芙仗着父母之势\n"+
                       "，竟是如此无法无天。表姊，咱们不能便此跟她罢休。她父母是当世大侠，便又怎样？”小龙\n"+
                       "女道：“这件事也怪不得她，倒和斩断他手臂不同。”程英道：“杨大嫂，我师父曾说，以内\n"+
                       "力裹住毒质，虽可使其一时不致发作，但毒质停留愈久，愈是伤身，须得及早设法解毒才是。\n"+
                       "”小龙女“嗯”了一声，杨过心想：“天竺僧醒转之后，是否有法可以解毒，实所难言。”他\n"+
                       "不愿多谈此事，以增小龙女烦恼和自己伤心，说道：“郭伯母和一灯大师等对付那疯和尚不知\n"+
                       "怎样了，咱们瞧瞧去。”\n"NOR,me);
  	remove_call_out("action4");
    call_out("action4", 1, me);  
}

void action4(object me)
{
  if(!me) return;
     message_vision(HIC"当下四人觅路回向大厅，离厅尚有十余丈，只见厅顶上人影一闪，认出是公孙止，接着“喀喇\n"+
                       "喇”一声响，见他打破屋顶，跳了下去。杨过生怕公孙止在这屋顶破洞下布置了带刀渔网阵，\n"+
                       "要引自己入彀，于是挺玄铁重剑撞开铁门，昂首直入。\n"NOR,me);
  	remove_call_out("action5");
    call_out("action5", 1, me);  
}


void action5(object me)
{
  if(!me) return;
     message_vision(HIG"公孙止夺得绝情丹到手，虽见黄蓉等好手群集，却也不以为意，心想：“我便打不过，难道还\n"+
                       "跑不了么？”正要夺路外闯，猛见杨过破门直入，声势威猛之极。他一惊之下，双足一点，腾\n"+
                       "身而起，要从屋顶破洞中重行跃出，心想眼下首要之事，是将绝情丹送去给李莫愁服食解毒，\n"+
                       "至于杀裘千尺、夺绝情谷，那是来日方长，不必急急。他身子甫起，黄蓉已抢过打狗棒跟着跃\n"+
                       "高，使个“缠”字诀，往他脚上缠去。裘千尺喝道：“老贼！”呼的一声，一枚枣核钉往公孙\n"+
                       "止小腹上射去。公孙止纵起时便已防到此招，挥刀挡开铁钉，上跃之势竟丝毫不缓，耳听得风\n"+
                       "声劲急，第二枚枣核钉又从斜刺里射到，但金刀已击出在外，不及收回再挡，黄蓉的打狗棒又\n"+
                       "跟着缠到，拼着大腿洞穿，也决不能让铁钉射入小腹，当下侧身横腿，抵挡铁钉。\n"NOR,me);
    remove_call_out("action6");
    call_out("action6", 1, me);  
}

void action6(object me)
{
  if(!me) return;
     message_vision(HIW"那知道裘千尺这一钉竟不是射向公孙止，准头却是对准了黄蓉。这一下奇变横生，连黄蓉也万\n"+
                       "万料想不到，急挥打狗棒挡隔，但枣核钉劲力实在太强，只感全身一震，手臂酸软，“啪”的\n"+
                       "一声，打狗棒掉在地下，身子跟着落地。公孙止上跃之力也尽，落在黄蓉身侧，横刀向她砍去\n"+
                       "公孙止见强敌环伺，心下早有计较：“天幸恶妇痰迷心窍，在这紧急关头去打了郭夫人一枚枣\n"+
                       "核钉，只要引得她们双方争斗，我便可乘机脱身。”当下纵声笑道：“好好好，乖女儿，真不\n"+
                       "枉爹爹疼爱，你和妈妈守住这边，要令今日来到咱们绝情谷的外人，个个来得去不得。”说着\n"+
                       "举刀提剑，突向倚在椅上的黄蓉杀去。黄蓉右臂兀自酸软，提不起打狗棒，只得侧身而避。郭\n"+
                       "芙手中一直握着耶律齐的长剑，当即挺剑护母。公孙止黑剑疾刺郭芙咽喉，郭芙举剑挡隔。黄\n"+
                       "蓉急叫：“小心！”铮的一声轻响，郭芙长剑立断，公孙止的黑剑去势毫不停留，直往她头颈\n"+
                       "削去。黄蓉急得一颗心几乎要从脖子中跳了出来，在这一刹那间竟无解救之方。陆无双有旁喝\n"+
                       "道：“举右臂去挡！”\n"NOR,me);
  	remove_call_out("action7");
    call_out("action7", 1, me);  
}

void action7(object me)
{
  if(!me) return;
     message_vision(HIC"公孙止怒道：“哼，适才我手下留情，难道当真便伤她不得。”说着抖动黑剑，发出嗡嗡之声\n"+
                       "郭芙暗想：“我既不怕他的刀剑，只须上前猛攻便是。跟他打有赢无输，这便宜如何不捡？”\n"+
                       "说道：“小武哥哥，你的剑给我，这老儿不信我家桃花岛的功夫，且让他见识见识。”武修文\n"+
                       "倒转长剑，将剑柄递了过去。郭芙伸手接住，挽个剑花，说道：“公孙老儿，你再上罢！”得\n"+
                       "意洋洋，有恃无恐，便似高手戏弄庸手一般神态。公孙止见她剑花一挽，便知她剑术的火候甚\n"+
                       "浅，喝道：“好，我再领教！”举刀向她面门砍去，郭芙身形斜闪，还了一剑。公孙止黑剑倒\n"+
                       "翻上来，往她剑上震去，郭芙心道：“不好！我身上有软猬甲，剑上却无护剑宝甲，双剑一交\n"+
                       "，我手中长剑又是非断不可。”当即回剑避开。公孙止双手一并，刀剑均已握在右掌之中，跟\n"+
                       "着左掌拍出。郭芙大喜：“你这掌拍在我软猬甲上，那是倒大霉啦！”但恐他掌力厉害，拍在\n"+
                       "身上不免要内脏受震，于是身子略侧，要先卸去他七成掌力，然后再受他这掌。\n"NOR,me);
  	remove_call_out("action8");
    call_out("action8", 1, me);  
}

void action8(object me)
{
  if(!me) return;
     message_vision(HIG"那知公孙止一掌尚未使老，突然倒纵丈余，说道：“好丫头，暗箭伤人！”身子向前直跌。郭\n"+
                       "芙愕然说道：“我没伤到你啊！”不禁大奇：“难道软猬甲真有如此妙用？他手掌尚未沾及我\n"+
                       "衣，竟然便已受伤。”她又怎知公孙止老奸巨滑，心中只是念着要将绝情丹速去送给李莫愁服\n"+
                       "食，那有闲心跟郭芙这般小丫头争强斗胜？他假装受伤摔跌，脚下似乎站立不定，几个踉跄，\n"+
                       "跌跌撞撞的冲向后堂。他在这片刻之间，已将敌情审查清楚，正面杨过和黄蓉是厉害人物，还\n"+
                       "有那长眉老僧虽似神游入定，但决非易与之辈，正好乘着郭芙似乎得手之际，便此从后堂溜走\n"+
                       "公孙绿萼见他怀了绝情丹要走，忙纵身向前，说道：“爹爹慢走！”便在此时，尖啸声起，两\n"+
                       "枚枣核钉也已袭向公孙止。裘千尺生怕公孙止一闪避，铁钉便打中女儿，因此铁钉喷出时取势\n"+
                       "甚高，射向他后脑。公孙止一低头，两枚铁钉从绿萼鬓上掠过，叮叮两响，钉入了石壁。公孙\n"+
                       "止喝道：“让开！”脚下毫不停留，绿萼道：“你把绝情丹……”话未说完，公孙止左手前伸\n"+
                       "，扣住她手腕脉门，转过身来，将女儿挡在胸前，喝道：“恶妇，你真要拼命，大家同归于尽\n"+
                       "了罢！”\n"NOR,me);
  	remove_call_out("action9");
    call_out("action9", 1, me);  
}

void action9(object me)
{
  if(!me) return;
     message_vision(HIC"这时杨过已截住他的去路，说道：“咱们万事须得有个了断，别忙就走！”公孙止将女儿举起\n"+
                       "狞笑道：“你敢拦我？”以左脚为轴，滴溜溜转了个圆圈，跟着又以右脚为轴，再转一圈，两\n"+
                       "个圈子一转，已向前趋了四尺，离杨过已近。杨过见他又是一个圈子转上，惟恐伤了绿萼，忙\n"+
                       "向旁跃开。公孙绿萼身在父亲手中，动弹不得，一个圈子转过来时，陡然见到杨过跳跃相避，\n"+
                       "让开了去路，眼光中充满着关怀之情，不禁芳心大慰：“他为了我，宁可不要解药！我死也瞑\n"+
                       "目了。”她手足虽不能动，头颈却能转动，低声叫道：“杨郎，杨郎！”额头撞向公孙止挺起\n"+
                       "的黑剑。黑剑锋锐异常公孙绿萼登时香消玉殒，死在父亲手里！杨过大叫一声：“啊哟！”抢\n"+
                       "上欲救，那里还来得及？公孙止也是吃了一惊，心中微微一酸，耳听得背后怒喝，三枚枣核钉\n"+
                       "电闪而至，当即将女儿的尸体向身后抛出，三枚铁钉尽数打在她身上。众人见他如此狠毒，绿\n"+
                       "萼身死后尚对她这般糟蹋，无不大愤，纷纷拔出兵刃拥上。\n"NOR,me);
  	remove_call_out("action10");
    call_out("action10", 1, me);  
}

void action10(object me)
{
  if(!me) return;
     message_vision(HIG"公孙止叫道：“众弟子，恶妇勾结外敌，要杀尽我绝情谷中男女老幼。渔网刀阵，一齐围上了\n"+
                       "。”众弟子自来对他奉若神明，那日他被裘千尺打瞎眼睛逃走，众弟子无所适从，只得遵奉裘\n"+
                       "千尺的号令，这时听得他一叫，谁也不及细想，执起带刀渔网从四角围了上来。每张渔网都是\n"+
                       "两丈见方，网上明晃晃的缀满了尖刀利刃。众人武功虽强，实不知如何应付才是，眼见四周渔\n"+
                       "网向中间一合，每人身上难免洞穿十来个窟窿。这一包上来，连裘千尺也围在其内。她大声呼\n"+
                       "喝：“众弟子别听老贼胡言乱语，大家停步，快停步！”但众弟子充耳不闻，只听得公孙止喝\n"+
                       "着号令：“坤网向前，坎网斜退向左，震网转右！”众弟子应声施为，一张张带刀渔网渐渐逼\n"+
                       "近。黄蓉从怀中摸出一把钢针，扬手向西首八名绿衣弟子射去，眼见相距既近，钢针又多，八\n"+
                       "名弟子至少也会有五六人受伤，渔网阵打出缺口，便可由此冲出。却听得叮叮叮、铮铮铮几声\n"+
                       "响，黄蓉所发钢针，裘千尺所喷铁钉，钱被渔网上的吸铁石收了去。黄蓉暗叫：“不好！”喝\n"+
                       "道：“芙儿，举剑护住头脸，强攻破网。”\n"NOR,me);
    remove_call_out("action11");
    call_out("action11", 1, me);  
}

void action11(object me)
{
  if(!me) return;
     message_vision(HIW"郭芙听了母亲的呼喝，抖动长剑，向东北角疾冲，四名弟子张开渔网，向她兜去，五六把尖刀\n"+
                       "碰到她身上软猬宝甲，渔网反弹，但持网的弟子跟着分从左右抢前，尖刀虽然伤她不得，渔网\n"+
                       "却仍要将她裹住。杨过站在公孙止身后，本在渔网阵之外，但八张渔网随着公孙止的号令左兜\n"+
                       "右转，已将他围入阵内。杨过见情势危急，提起玄铁重剑，运劲往郭芙身前的渔网上斩去。“\n"+
                       "垮喇喇”一声响，渔网裂成两片，拉着网角的四名弟子同时摔倒。武三通、耶律齐等更不怠慢\n"+
                       "，拳掌齐施，摧筋断骨，将这四名弟子手足打伤，以防他们更携新网，再来围攻。杨过纵声长\n"+
                       "啸，两剑挥过，又是两旁张渔网散裂破败。这渔网以金丝和钢线绞成，极坚极韧，但玄铁重剑\n"+
                       "无坚不摧，三剑斩出，三网立破。众弟子齐声惊呼，向后退开。公孙止喝道：“五网齐上！他\n"+
                       "一剑难破五网！”杨过心想“五张渔网一齐卷上，确也难挡。”随即斜步向左，制敌机先，砰\n"+
                       "的一声，又斩破了一张。渔网拉得甚紧，一剑斩落，破网声如裂金石。便在此时，忽听得厅外\n"+
                       "一人厉声斥道：“往那里走？”黄影晃动，一人从厅门蹿了出来，仗剑傲立，正是赤练仙子李\n"+
                       "莫愁。\n"NOR,me);
  	remove_call_out("action12");
    call_out("action12", 1, me);  
}

void action12(object me)
{
  if(!me) return;
     message_vision(HIC"两人剑来指去，拆了数招，朱子柳见天竺僧俯伏在地下，毫不动弹，叫道：“师叔，师叔！”\n"+
                       "天竺僧并无应声。李莫愁笑道：“你要他答应，倒也容易。只消你也吃我一枚毒针，到阴世去\n"+
                       "叫他便是。”朱子柳心中悲痛，更增敌忾之念，一招一式，丝毫不乱，出指时劲力反加。星月\n"+
                       "微光之下，李莫愁见他眼神如电，招招抢攻，竟是同归于尽的拼命打法，再拆数招，不禁害怕\n"+
                       "起来，长剑急攻两招，转身便走。朱子柳俯身一搭师叔的手腕，脉息全无，已然死去多时，一\n"+
                       "声悲啸，提气向李莫愁疾追。两人一前一后的奔进了大厅。公孙止见李莫愁赶到，又惊又喜，\n"+
                       "叫道：“李道友到这边来！”说着迎将上去。黄蓉一见公孙止的神气，已自猜到了几分，叫道\n"+
                       "：“过儿，隔开这两个魔头，别让他们凑近！”杨过听得天竺僧的死讯，已然万念俱灰，绝情\n"+
                       "丹是公孙止得去也好，不是他得去也好，全没放在心上，听到黄蓉呼喝，只微微苦笑，却不出\n"+
                       "手。耶律齐拾起半张斩裂的带刀渔网，叫道：“敦儒兄，拉住这边。”他和武敦儒、完颜萍、\n"+
                       "耶律燕四人各自抓住渔网一角，拦在公孙止和李莫愁之间。厅上这么一乱，众绿衣弟子错了步\n"+
                       "伐。裘千尺乘机喷吐枣核铁钉，众弟子忙乱中不及张网收钉，接连有五人中钉毙命，带刀渔网\n"+
                       "阵七零八落，登时溃散。\n"NOR,me);
  	remove_call_out("action13");
    call_out("action13", 1, me);  
}

void action13(object me)
{
  if(!me) return;
     message_vision(HIG"公孙止大声叫道：“李道友，咱们分路出去，到适才见面之处相会。”两个齐声呼哨，分自左\n"+
                       "右掠过杨过和小龙女身畔，蹿出厅去。杨过视而不见，毫不理会。黄蓉叫道：“龙家妹子，截\n"+
                       "住在公孙止，绝情丹在他身上。”小龙女一惊，心想：“天竺僧既死，过儿身上的花毒全仗这\n"+
                       "半枚绝情丹化解。”当即挣脱杨过的手，飞步向公孙止追去。杨过叫道：“由得他去罢！”小\n"+
                       "龙女道：“怎能由得他去？”杨过只得在后跟随。公孙止和李莫愁一个奔向东北，一个向西北\n"+
                       "而行，众人也是分头追赶。小龙女、杨过、程英、陆无双四人追赶公孙止。武氏父子、朱子柳\n"+
                       "、完颜萍五人追赶李莫愁。耶律齐兄妹和郭芙留着陪伴一灯和黄蓉，监视裘千尺。\n"NOR,me);
  	 me->set_temp("quest/jindaoheijian/waityd",0);
     me->set_temp("quest/jindaoheijian/zhuigsz",1);  
   	 message_vision(HIG"\n大家跟着黄蓉追了出去，你也跟着追了出去。\n"NOR,me);
   	 me->move("/d/gumu/jqg/shanlu10"); 
   	 
   	 remove_call_out("action14");
    call_out("action14", 5, me);  
}

void action14(object me)
 {
  if(!me) return;
  	message_vision(HIG"\n你突然发现公孙止就站在旁边。\n"NOR,me); 
  	message_vision(HIR"\n公孙止很惊恐的看着你。\n"NOR,me); 
  	"d/gumu/jqg/npc/supergongsun.c"->move("/d/gumu/jqg/shanlu10"); 
  }

  	
