// designed by Yu Jue
// Modified by snowman@SJ 12/06/2000
// Powered by Yu Jue 2000-08/09
// Powered again by YUJ@SJ 2001-05-06

#define HW "[1;37;40m"
#define BK "[0;30;40m"

#define FONTLIB 2

#include <ansi.h>

inherit NPC;

mixed keypos=({
	({ 0,0,0,0,0,0,0,0,0,0 }),
	({ 0,0,0,0,0,0,0,0,0,0 })
});

mixed keylen=({
	({  8, 4, 8, 8, 8, 8, 8, 8, 8, 8 }),
	({ 10, 4,10,10,10,10,10,10,10,10 })
});

mixed key=({
/*	({
		"©°¡ö¡ö¡ö©°¡ö©°¡ö¡ö¡ö©°¡ö¡ö¡ö©°¡ö©°¡ö©°¡ö¡ö¡ö©°¡ö¡ö¡ö©°¡ö¡ö¡ö©°¡ö¡ö¡ö©°¡ö¡ö¡ö",
		"©¦¡ö©´¡ö©¦¡ö©¸©¤©´¡ö©¸©¤©´¡ö©¦¡ö©¦¡ö©¦¡ö©¤©¼©¦¡ö©¤©¼©¸©¤©´¡ö©¦¡ö©´¡ö©¦¡ö©´¡ö",
		"©¦¡ö©¦¡ö©¦¡ö©°¡ö¡ö¡ö©°¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö¡¡¡¡©¦¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö",
		"©¦¡ö©¦¡ö©¦¡ö©¦¡ö©¤©¼©¸©¤©´¡ö©¸©¤©´¡ö©¸©¤©´¡ö©¦¡ö©´¡ö¡¡¡¡©¦¡ö©¦¡ö©´¡ö©¸©¤©´¡ö",
		"©¦¡ö¡ö¡ö©¦¡ö©¦¡ö¡ö¡ö©°¡ö¡ö¡ö¡¡¡¡©¦¡ö©°¡ö¡ö¡ö©¦¡ö¡ö¡ö¡¡¡¡©¦¡ö©¦¡ö¡ö¡ö©°¡ö¡ö¡ö",
		"©¸©¤©¤©¼©¸©¼©¸©¤©¤©¼©¸©¤©¤©¼¡¡¡¡©¸©¼©¸©¤©¤©¼©¸©¤©¤©¼¡¡¡¡©¸©¼©¸©¤©¤©¼©¸©¤©¤©¼"
	}),
	({
		"©°¡ö¡ö¡ö¡ö©°¡ö©°¡ö¡ö¡ö¡ö©°¡ö¡ö¡ö¡ö©°¡ö¡¡©°¡ö©°¡ö¡ö¡ö¡ö©°¡ö¡ö¡ö¡ö©°¡ö¡ö¡ö¡ö©°¡ö¡ö¡ö¡ö©°¡ö¡ö¡ö¡ö",
		"©¦¡ö©¤©´¡ö©¦¡ö©¸©¤©¤©´¡ö©¸©¤©¤©´¡ö©¦¡ö¡¡©¦¡ö©¦¡ö©¤©¤©¼©¦¡ö©¤©¤©¼©¸©¤©¤©´¡ö©¦¡ö©¤©´¡ö©¦¡ö©¤©´¡ö",
		"©¦¡ö¡¡©¦¡ö©¦¡ö©°¡ö¡ö¡ö¡ö©°¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö¡¡¡¡¡¡©¦¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö",
		"©¦¡ö¡¡©¦¡ö©¦¡ö©¦¡ö©¤©¤©¼©¸©¤©¤©´¡ö©¸©¤©¤©´¡ö©¸©¤©¤©´¡ö©¦¡ö©¤©´¡ö¡¡¡¡¡¡©¦¡ö©¦¡ö©¤©´¡ö©¸©¤©¤©´¡ö",
		"©¦¡ö¡ö¡ö¡ö©¦¡ö©¦¡ö¡ö¡ö¡ö©°¡ö¡ö¡ö¡ö¡¡¡¡¡¡©¦¡ö©°¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö¡¡¡¡¡¡©¦¡ö©¦¡ö¡ö¡ö¡ö©°¡ö¡ö¡ö¡ö",
		"©¸©¤©¤©¤©¼©¸©¼©¸©¤©¤©¤©¼©¸©¤©¤©¤©¼¡¡¡¡¡¡©¸©¼©¸©¤©¤©¤©¼©¸©¤©¤©¤©¼¡¡¡¡¡¡©¸©¼©¸©¤©¤©¤©¼©¸©¤©¤©¤©¼"
	}),
	({
		"¡ö¡ö¡ö©´¡ö©´¡ö¡ö¡ö©´¡ö¡ö¡ö©´¡ö©´¡ö©´¡ö¡ö¡ö©´¡ö¡ö¡ö©´¡ö¡ö¡ö©´¡ö¡ö¡ö©´¡ö¡ö¡ö©´",
		"¡ö©°¡ö©¦¡ö©¦©¸©¤¡ö©¦©¸©¤¡ö©¦¡ö©¦¡ö©¦¡ö©°©¤©¼¡ö©°©¤©¼©¸©¤¡ö©¦¡ö©°¡ö©¦¡ö©°¡ö©¦",
		"¡ö©¦¡ö©¦¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö©´¡ö¡ö¡ö©´¡¡¡¡¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦",
		"¡ö©¦¡ö©¦¡ö©¦¡ö©°©¤©¼©¸©¤¡ö©¦©¸©¤¡ö©¦©¸©¤¡ö©¦¡ö©°¡ö©¦¡¡¡¡¡ö©¦¡ö©°¡ö©¦©¸©¤¡ö©¦",
		"¡ö¡ö¡ö©¦¡ö©¦¡ö¡ö¡ö©´¡ö¡ö¡ö©¦¡¡¡¡¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦¡¡¡¡¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦",
		"©¸©¤©¤©¼©¸©¼©¸©¤©¤©¼©¸©¤©¤©¼¡¡¡¡©¸©¼©¸©¤©¤©¼©¸©¤©¤©¼¡¡¡¡©¸©¼©¸©¤©¤©¼©¸©¤©¤©¼"
	}),
	({
		"¡ö¡ö¡ö¡ö©´¡ö©´¡ö¡ö¡ö¡ö©´¡ö¡ö¡ö¡ö©´¡ö©´¡¡¡ö©´¡ö¡ö¡ö¡ö©´¡ö¡ö¡ö¡ö©´¡ö¡ö¡ö¡ö©´¡ö¡ö¡ö¡ö©´¡ö¡ö¡ö¡ö©´",
		"¡ö©°©¤¡ö©¦¡ö©¦©¸©¤©¤¡ö©¦©¸©¤©¤¡ö©¦¡ö©¦¡¡¡ö©¦¡ö©°©¤©¤©¼¡ö©°©¤©¤©¼©¸©¤©¤¡ö©¦¡ö©°©¤¡ö©¦¡ö©°©¤¡ö©¦",
		"¡ö©¦¡¡¡ö©¦¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©´¡ö¡ö¡ö¡ö©´¡¡¡¡¡¡¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦",
		"¡ö©¦¡¡¡ö©¦¡ö©¦¡ö©°©¤©¤©¼©¸©¤©¤¡ö©¦©¸©¤©¤¡ö©¦©¸©¤©¤¡ö©¦¡ö©°©¤¡ö©¦¡¡¡¡¡¡¡ö©¦¡ö©°©¤¡ö©¦©¸©¤©¤¡ö©¦",
		"¡ö¡ö¡ö¡ö©¦¡ö©¦¡ö¡ö¡ö¡ö©´¡ö¡ö¡ö¡ö©¦¡¡¡¡¡¡¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦¡¡¡¡¡¡¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦",
		"©¸©¤©¤©¤©¼©¸©¼©¸©¤©¤©¤©¼©¸©¤©¤©¤©¼¡¡¡¡¡¡©¸©¼©¸©¤©¤©¤©¼©¸©¤©¤©¤©¼¡¡¡¡¡¡©¸©¼©¸©¤©¤©¤©¼©¸©¤©¤©¤©¼"
	}),
	({
		"©°©¤©¤©´©°©´©°©¤©¤©´©°©¤©¤©´©°©´©°©´©°©¤©¤©´©°©¤©¤©´©°©¤©¤©´©°©¤©¤©´©°©¤©¤©´",
		"©¦¡ö¡ö¡ö©¦¡ö©¸¡ö¡ö¡ö©¸¡ö¡ö¡ö©¦¡ö©¦¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö©¸¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö",
		"©¦¡ö©¦¡ö©¦¡ö©°©¤©¤¡ö©°©¤©¼¡ö©¦¡ö©¼¡ö©¦¡ö©¤©´©¦¡ö©¤©´¡¡¡¡©¦¡ö©¦¡ö©¼¡ö©¦¡ö©¼¡ö",
		"©¦¡ö©¦¡ö©¦¡ö©¦¡ö¡ö¡ö©¸¡ö¡ö¡ö©¸¡ö¡ö¡ö©¸¡ö¡ö¡ö©¦¡ö¡ö¡ö¡¡¡¡©¦¡ö©¦¡ö¡ö¡ö©¸¡ö¡ö¡ö",
		"©¦¡ö©¼¡ö©¦¡ö©¦¡ö©¤©´©°©¤©¼¡ö¡¡¡¡©¦¡ö©°©¤©¼¡ö©¦¡ö©¼¡ö¡¡¡¡©¦¡ö©¦¡ö©¼¡ö©°©¤©¤¡ö",
		"©¸¡ö¡ö¡ö©¸¡ö©¸¡ö¡ö¡ö©¸¡ö¡ö¡ö¡¡¡¡©¸¡ö©¸¡ö¡ö¡ö©¸¡ö¡ö¡ö¡¡¡¡©¸¡ö©¸¡ö¡ö¡ö©¸¡ö¡ö¡ö"
	}),
	({
		"©°©¤©¤©¤©´©°©´©°©¤©¤©¤©´©°©¤©¤©¤©´©°©´¡¡©°©´©°©¤©¤©¤©´©°©¤©¤©¤©´©°©¤©¤©¤©´©°©¤©¤©¤©´©°©¤©¤©¤©´",
		"©¦¡ö¡ö¡ö¡ö©¦¡ö©¸¡ö¡ö¡ö¡ö©¸¡ö¡ö¡ö¡ö©¦¡ö¡¡©¦¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¸¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö",
		"©¦¡ö¡¡©¦¡ö©¦¡ö©°©¤©¤©¤¡ö©°©¤©¤©¼¡ö©¦¡ö©¤©¼¡ö©¦¡ö©¤©¤©´©¦¡ö©¤©¤©´¡¡¡¡¡¡©¦¡ö©¦¡ö©¤©¼¡ö©¦¡ö©¤©¼¡ö",
		"©¦¡ö¡¡©¦¡ö©¦¡ö©¦¡ö¡ö¡ö¡ö©¸¡ö¡ö¡ö¡ö©¸¡ö¡ö¡ö¡ö©¸¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö¡¡¡¡¡¡©¦¡ö©¦¡ö¡ö¡ö¡ö©¸¡ö¡ö¡ö¡ö",
		"©¦¡ö©¤©¼¡ö©¦¡ö©¦¡ö©¤©¤©´©°©¤©¤©¼¡ö¡¡¡¡¡¡©¦¡ö©°©¤©¤©¼¡ö©¦¡ö©¤©¼¡ö¡¡¡¡¡¡©¦¡ö©¦¡ö©¤©¼¡ö©°©¤©¤©¤¡ö",
		"©¸¡ö¡ö¡ö¡ö©¸¡ö©¸¡ö¡ö¡ö¡ö©¸¡ö¡ö¡ö¡ö¡¡¡¡¡¡©¸¡ö©¸¡ö¡ö¡ö¡ö©¸¡ö¡ö¡ö¡ö¡¡¡¡¡¡©¸¡ö©¸¡ö¡ö¡ö¡ö©¸¡ö¡ö¡ö¡ö"
	}),
	({
		"©°©¤©¤©´©°©´©°©¤©¤©´©°©¤©¤©´©°©´©°©´©°©¤©¤©´©°©¤©¤©´©°©¤©¤©´©°©¤©¤©´©°©¤©¤©´",
		"¡ö¡ö¡ö©¦¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦¡ö©¦¡ö©¦¡ö¡ö¡ö©¼¡ö¡ö¡ö©¼¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦",
		"¡ö©¦¡ö©¦¡ö©¦©°©¤¡ö©¦©°©¤¡ö©¦¡ö©¸¡ö©¦¡ö©¸©¤©´¡ö©¸©¤©´¡¡¡¡¡ö©¦¡ö©¸¡ö©¦¡ö©¸¡ö©¦",
		"¡ö©¦¡ö©¦¡ö©¦¡ö¡ö¡ö©¼¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦¡¡¡¡¡ö©¦¡ö¡ö¡ö©¦¡ö¡ö¡ö©¦",
		"¡ö©¸¡ö©¦¡ö©¦¡ö©¤©¤©´©°©¤¡ö©¦¡¡¡¡¡ö©¦©°©¤¡ö©¦¡ö©¸¡ö©¦¡¡¡¡¡ö©¦¡ö©¸¡ö©¦©°©¤¡ö©¦",
		"¡ö¡ö¡ö©¼¡ö©¼¡ö¡ö¡ö©¼¡ö¡ö¡ö©¼¡¡¡¡¡ö©¼¡ö¡ö¡ö©¼¡ö¡ö¡ö©¼¡¡¡¡¡ö©¼¡ö¡ö¡ö©¼¡ö¡ö¡ö©¼"
	}),
	({
		"©°©¤©¤©¤©´©°©´©°©¤©¤©¤©´©°©¤©¤©¤©´©°©´¡¡©°©´©°©¤©¤©¤©´©°©¤©¤©¤©´©°©¤©¤©¤©´©°©¤©¤©¤©´©°©¤©¤©¤©´",
		"¡ö¡ö¡ö¡ö©¦¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö©¦¡¡¡ö©¦¡ö¡ö¡ö¡ö©¼¡ö¡ö¡ö¡ö©¼¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦",
		"¡ö©¦¡¡¡ö©¦¡ö©¦©°©¤©¤¡ö©¦©°©¤©¤¡ö©¦¡ö©¸©¤¡ö©¦¡ö©¸©¤©¤©´¡ö©¸©¤©¤©´¡¡¡¡¡¡¡ö©¦¡ö©¸©¤¡ö©¦¡ö©¸©¤¡ö©¦",
		"¡ö©¦¡¡¡ö©¦¡ö©¦¡ö¡ö¡ö¡ö©¼¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦¡¡¡¡¡¡¡ö©¦¡ö¡ö¡ö¡ö©¦¡ö¡ö¡ö¡ö©¦",
		"¡ö©¸©¤¡ö©¦¡ö©¦¡ö©¤©¤©¤©´©°©¤©¤¡ö©¦¡¡¡¡¡¡¡ö©¦©°©¤©¤¡ö©¦¡ö©¸©¤¡ö©¦¡¡¡¡¡¡¡ö©¦¡ö©¸©¤¡ö©¦©°©¤©¤¡ö©¦",
		"¡ö¡ö¡ö¡ö©¼¡ö©¼¡ö¡ö¡ö¡ö©¼¡ö¡ö¡ö¡ö©¼¡¡¡¡¡¡¡ö©¼¡ö¡ö¡ö¡ö©¼¡ö¡ö¡ö¡ö©¼¡¡¡¡¡¡¡ö©¼¡ö¡ö¡ö¡ö©¼¡ö¡ö¡ö¡ö©¼"
	}),*/
	({
		"©°©¤©¤©´©°©´©°©¤©¤©´©°©¤©¤©´©°©´©°©´©°©¤©¤©´©°©¤©¤©´©°©¤©¤©´©°©¤©¤©´©°©¤©¤©´",
		"©¦©°©´©¦©¦©¦©¸©¤©´©¦©¸©¤©´©¦©¦©¦©¦©¦©¦©°©¤©¼©¦©°©¤©¼©¸©¤©´©¦©¦©°©´©¦©¦©°©´©¦",
		"©¦©¦©¦©¦©¦©¦©°©¤©¼©¦©°©¤©¼©¦©¦©¸©¼©¦©¦©¸©¤©´©¦©¸©¤©´¡¡¡¡©¦©¦©¦©¸©¼©¦©¦©¸©¼©¦",
		"©¦©¦©¦©¦©¦©¦©¦©°©¤©¼©¸©¤©´©¦©¸©¤©´©¦©¸©¤©´©¦©¦©°©´©¦¡¡¡¡©¦©¦©¦©°©´©¦©¸©¤©´©¦",
		"©¦©¸©¼©¦©¦©¦©¦©¸©¤©´©°©¤©¼©¦¡¡¡¡©¦©¦©°©¤©¼©¦©¦©¸©¼©¦¡¡¡¡©¦©¦©¦©¸©¼©¦©°©¤©¼©¦",
		"©¸©¤©¤©¼©¸©¼©¸©¤©¤©¼©¸©¤©¤©¼¡¡¡¡©¸©¼©¸©¤©¤©¼©¸©¤©¤©¼¡¡¡¡©¸©¼©¸©¤©¤©¼©¸©¤©¤©¼"
	}),
	({
		"©°©¤©¤©¤©´©°©´©°©¤©¤©¤©´©°©¤©¤©¤©´©°©´¡¡©°©´©°©¤©¤©¤©´©°©¤©¤©¤©´©°©¤©¤©¤©´©°©¤©¤©¤©´©°©¤©¤©¤©´",
		"©¦©°©¤©´©¦©¦©¦©¸©¤©¤©´©¦©¸©¤©¤©´©¦©¦©¦¡¡©¦©¦©¦©°©¤©¤©¼©¦©°©¤©¤©¼©¸©¤©¤©´©¦©¦©°©¤©´©¦©¦©°©¤©´©¦",
		"©¦©¦¡¡©¦©¦©¦©¦©°©¤©¤©¼©¦©°©¤©¤©¼©¦©¦©¸©¤©¼©¦©¦©¸©¤©¤©´©¦©¸©¤©¤©´¡¡¡¡¡¡©¦©¦©¦©¸©¤©¼©¦©¦©¸©¤©¼©¦",
		"©¦©¦¡¡©¦©¦©¦©¦©¦©°©¤©¤©¼©¸©¤©¤©´©¦©¸©¤©¤©´©¦©¸©¤©¤©´©¦©¦©°©¤©´©¦¡¡¡¡¡¡©¦©¦©¦©°©¤©´©¦©¸©¤©¤©´©¦",
		"©¦©¸©¤©¼©¦©¦©¦©¦©¸©¤©¤©´©°©¤©¤©¼©¦¡¡¡¡¡¡©¦©¦©°©¤©¤©¼©¦©¦©¸©¤©¼©¦¡¡¡¡¡¡©¦©¦©¦©¸©¤©¼©¦©°©¤©¤©¼©¦",
		"©¸©¤©¤©¤©¼©¸©¼©¸©¤©¤©¤©¼©¸©¤©¤©¤©¼¡¡¡¡¡¡©¸©¼©¸©¤©¤©¤©¼©¸©¤©¤©¤©¼¡¡¡¡¡¡©¸©¼©¸©¤©¤©¤©¼©¸©¤©¤©¤©¼"
	})
});

string ans="", ans1, fakeans="";
string str = "\nÒøÒíÉ±ÊÖËµµÀ£ºÇëÓÃ answer »Ø´ğ£¬ÏÂÃæÕâĞĞÊı×ÖÊÇ£¿\n";
int aflag;
int num = 2;

#include "antirobot.h";

void question()
{
	message("channel", HIW+str+NOR, ob);
	aflag = 1;
}

int do_answer(string arg)
{
	object me = this_object();
	int len = strlen(ans);

	if (arg && aflag) {
		if (ans1 == arg) command("wiz "+ob->query("id")+" ¼«¿ÉÄÜÊ¹ÓÃÁË×Ô¶¯Ó¦´ğ»úÆ÷ÈË£¬Çë¼ì²é£¡");
		else ans1 = arg;
		aflag = 0;
	}
	if (strlen(arg) != len) return notify_fail("´ğ°¸µÄ³¤¶È²»¶Ô£¬ÔÙ×ĞÏ¸¿´¿´¡£\n");
	if (arg==ans) {
		message_vision("$NµãÁËµãÍ·£¬ËµµÀ£ºOK£¬$n¼ÌĞøÃ¦°É¡£\n", me, ob);
		message_vision("$NÍ»È»ÏûÊ§²»¼ûÁË¡£\n", me);
	} else {
		if (arg==fakeans) command("wiz "+ob->query("id")+" ¾ø¶ÔÊ¹ÓÃÁË×Ô¶¯Ó¦´ğ»úÆ÷ÈË£¬Çë´ş²¶£¡");
		if (num--) return notify_fail("´ğ°¸²»¶Ô£¬ÔÙ×ĞÏ¸¿´¿´¡£\n");
		else {
			message_vision("$NÌ¾ÁË¿ÚÆøµÀ£º"+arg+"£¿"+ans+"²Å¶Ô£¬ÕâÃ´¼òµ¥¶¼´ğ²»³ö£¿È¥·¨Í¥½ÓÊÜñöÑ¶°É£¡\n", me);
			move_to_court(ob);
		}
	}
	destruct(this_object());
	return 1;
}

void test_robot(object obj)
{
	int len, temp, c, l, font, pos, end;
	string *line=({"", "", "", "", "", ""}), ta = "";
	string *line1=({"", "", "", "", "", ""}), gap;
	object me = this_object();

	ob = obj;
	if (environment(ob) && !ob->is_fighting()) {
		message("channel", "ÒøÒíÉ±ÊÖÂÔ´øÇ¸ÒâµØËµ£º¡°»úÆ÷ÈË»ü²é£¬ÀıĞĞ¹«ÊÂ£¬Çë»Ø´ğÒ»¸öĞ¡ÎÊÌâ¡£¡±\n", ob);
		message("channel", "Èç¹ûÀûÓÃ»úÆ÷×Ô¶¯»Ø´ğÎÊÌâ£¬µµ°¸½«±»ÎŞÌõ¼şÉ¾³ı¡£\n", ob);
		for (l = 0; l < FONTLIB; l++)
			for (temp = 1; temp < 10; temp++)
				keypos[l][temp] = keypos[l][temp-1] + keylen[l][temp-1];

		// Éú³É´ğ°¸
		temp = len = random(2) + 2;
		while (temp--) {
			ans += "0";
			ans[<1] += random(10);
			fakeans += "0";
			fakeans[<1] += ans[<1] == '1'?1:2+random(8);
		}

		for (temp = 0; temp < len; temp++) {
			gap = repeat_string("¡¡", 1+random(3));
			c = ans[temp] - '0';
			font = random(FONTLIB);
			pos = keypos[font][c];
			end = pos + keylen[font][c] -1;
			for (l = 0; l < 6; l++)
				line[l] += gap + key[font][l][pos..end];
			c = fakeans[temp] - '0';
			pos = keypos[font][c];
			end = pos + keylen[font][c] -1;
			for (l = 0; l < 6; l++)
				line1[l] += gap + key[font][l][pos..end];
		}
		for (l = -1; l < strlen(strip(line[0]))/2; l++) ta += "¡¡";
		ta += "\n";
		str += HW + ta;
		for (l = 0; l < 6; l++)
			str += (random(3)?"":line1[l] + "¡¡\n[A") + line[l] + "¡¡" +(random(2)?"":" ") + "\n";
		str += ta;
//* ¸ÉÈÅ×Ö·û
		for (l = 50; l < strlen(str); l++) {
			if (str[l] < 161) continue;
			if (str[l..l+1] == "¡¡") {
				if (!random(3)) {
					string *tab = key[random(FONTLIB)];

					ta = tab[random(sizeof(tab))];
					c = random(sizeof(ta)/2)*2;
					str = str[0..l-1]
						+ BK + ta[c..c+1]
						+ HW + str[l+2..<1];
					l += strlen(BK+HW);
				}
			}
			l++;
		}
//*/
		timer = 180;
		call_out("test1", 10);
		me->move(ob, 1);
	} else destruct(me);
}
